import lab4.PetsManager as PetsManager


def test_append(pet_manager: PetsManager.PetsManager):
    pet_manager.add_pet(0, "Кот", "Муся", "Черный", "10.05.2015", "Тест Тест Тест", "+79589785698")
    pet_manager.add_pet(1, "Кот", "Вася", "Белый", "21.07.2014", "Тес Тет Тек", "+79785698759")
    pet_manager.add_pet(2, "Собака", "Шарик", "Коричневый", "12.12.2013", "Мек Век Дат", "+79536205579")
    pet_manager.add_pet(3, "Собака", "Брейн", "Черный", "17.09.2018", "Тест Тест Тест", "+79200697573")
    pet_manager.add_pet(4, "Филин", "Визор", "Коричневый", "15.03.2019", "Дун Мак Рич", "+79997895850")
